# Задание 1.
# Напишите программу Python, которая преобразует все символы в верхний и нижний регистры и удаляет
# повторяющиеся буквы из заданной последовательности. Используйте функцию map ().
#
# Пример:
# INPUT:  {'U', 'f', 'a', 'b', 'i', 'o', 'E'}
# OUTPUT: {('B', 'b'), ('A', 'a'), ('U', 'u'), ('I', 'i'), ('O', 'o'), ('E', 'e'), ('F', 'f')}

def set_to_str(elem_set):

    return str.upper(elem_set), str.lower(elem_set)


if __name__ == "__main__":

    #set_1 = {'U', 'f', 'a', 'b', 'i', 'o', 'E'}
    set_1 = ['U', 'f', 'a', 'b', 'i', 'o', 'E', 'u', 'F']    # С повторяющимися элементами
    str_ = map(set_to_str, set_1)
    print(set(str_))